netify-soap/src/test/resources/soap/requests/movie/DeleteMovieRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:DeleteMovieRequest>
            <gen:id>1</gen:id>
        </gen:DeleteMovieRequest>
    </soapenv:Body>
</soapenv:Envelope>